class StringConst {
  StringConst._();
//home strings
  static const home = "خانه";
  static const about = "درباره";
  static const sup = "پشتیبانی برنامه";
  static const supp = "راه های ارتباط با ما";
  static const developers = "توسعه دهندگان:";
  static const git = "مخزن گیت هاب";
  static const telegram = "پشتیبانی در تلگرام";
  static const eitaa = "پشتیبانی در اپ ایتا";
  static const amirreza = "امیررضا جلوس حقی";
  static const mohammad = "محمد دهقانی فرد";
  static const version = "نسخه برنامه ۱.۱";
  static const loaded = "کمی صبر کنید...";
  static const created = "ساخته شده با ❤️ در ایران زمین";
  static const aboutText =
      "همنشین یک بازی ایرانی مناسب دورهمی های دوستانه میان جوان های ایرانی است که به گونه ای طراحی شده است که کاربران به راحت ترین شیوه بازی های مختلف را اجرا نمایند ، این بازی در حال حاضر شامل شش بازی مهیج و جذاب به نام های  پانتومیم، شاه دزد جلاد، مافیا، جاسوس ، جرعت حقیقت، چشمک مرگ، است و ما قصد داریم در آینده و در آپدیت های بعدی بازی های بیشتری به این مجموعه اضافه شود .";
  static const help = "راهنما";
  static const pantomimGame = "بازی پانتومیم";
  static const jasosGame = "بازی جاسوس";
  static const mafiaGame = "بازی مافیا";
  static const sdjvGame = "بازی شاه دزد جلاد";
  static const cheshmakGame = "بازی چشمک مرگ";
  static const jorathaghighat = "جرعت یا حقیقت";
  static const dorehami = "دورهمی دور";
  static const aboutGame = "درباره بازی";
  static const commingSoonGame = "به زودی بازی هیجان انگیز";
//mafia game
  static const dialogTextField = "تعداد نفرات شرکت کننده در بازی چند نفر باشد؟";
  static const startGameBtn = "شروع بازی";
  static const gameStartInfo =
      "افراد به صورت نوبتی با کلیک بروی دکمه پایین نقششون رو به شکل رندوم مشخص می کنند";
  static const yourRoleBtn = "نقش من رو بگو!";
  static const hideYourRoleBtn = "نقش رو بپوشون!";
  static const yourRole = "نقش شما:";
  static const jasosWord = "کلمه :";
  static const endRole = "تمام نقش ها انتخاب شدن، بازی رو شروع کنین :)";
  static const goToHome = "رفتن به صفحه اصلی";
  static const forYourRole = "برای دیدن نقشت ضربه بزن!";
  static const mafiaSade = "مافیا ساده";
  static const shahrvandSade = "شهروند ساده";
  static const dr = "دکتر";
  static const karagah = "کارآگاه";
  static const sniper = "اسنایپر";
  static const jansakht = "جان سخت";
  static const ravanshenas = "روانشناس";
  //pantomim Strings
  static const pantomimStartInfo =
      "به صورت رندوم از میون کلی کلمات،کلمه مناسب رو برای اجرا پانتومیم خود پیدا کنید";
  static const yourPantomimBtn = "پانتومیم من رو بگو!";
  static const notSelectWords = "کلمه ای انتخاب نشده";
  static const yourWords = "کلمه شما:";
  //jorat haghighat
  static const jhInfo =
      "با چرخوندن بطری مشخص میشه کی باید از کی بپرسه جرعت یاحقیقت؟";
  static const rotateBtn = "بطریو بچرخون!";
  //shah dozd jallad vazir
  static const shah = "شاه";
  static const dozd = "دزد";
  static const jallad = "جلاد";
  static const vazir = "وزیر";
  static const notSelectRole = 'نقشی انتخاب نشده';
  // jasoos game
  static const jasoos = "جاسوس";
  static const shahrvand = "شهروند";
  static const kalantar = "کلانتر";
  static const joker = "جوکر";
  static const jasoosVijeh = "جاسوس ویژه";
  //cheshmak game
  static const endend = "تمام تمام!";
  static const backToHome = "بازگشت به خانه";
  static const startAgain = "شروع مجدد";
  static const karagah2 = "کارآگاه";
  static const ghatel = "قاتل";
  static const pooch = "پوچ";

  ///about game
  static const mafiaGameInfo =
      """در اپلیکیشن «هم نشین»، بازی مافیا به صورت هیجان‌انگیز و متفاوت ارائه می‌شود. با استفاده از این اپلیکیشن، شما می‌توانید با یک دکمه سبز رنگ به راحتی نقش خود را دریافت کنید و وارد دنیای جذاب و استراتژیک مافیا شوید. پس از کلیک روی دکمه، اپلیکیشن به طور تصادفی به شما یک نقش مناسب از میان نقش‌های مختلف بازی مافیا اختصاص می‌دهد.

نقش‌های بازی مافیا شامل موارد زیر هستند:
- **مافیا**: هدف حذف شهروندان است.
- **دکتر**: می‌تواند هر شب یک نفر را نجات دهد.
- **شهروند ساده**: هیچ قدرت خاصی ندارد و باید در روز مافیا را شناسایی کند.
- **روانشناس**: می‌تواند یک نفر را برای سایلنت کردن انتخاب کند.
- **جان‌سخت**: مقاوم در برابر اولین حمله مافیا.
- **اسنایپر**: می‌تواند یک بار در طول بازی به یک نفر شلیک کند.
- **کارآگاه**: هر شب می‌تواند هویت یکی از بازیکنان را بررسی کند.

روند بازی شامل دو بخش شب و روز است:
- **شب**: بازیکنان چشمان خود را می‌بندند و نقش‌ها به نوبت عمل می‌کنند (مافیا، دکتر، کارآگاه و ...).
- **روز**: بازیکنان چشمان خود را باز کرده و درباره فرد کشته‌شده بحث می‌کنند تا مافیا را شناسایی کنند.

هدف بازی برای مافیا حذف شهروندان و برای شهروندان شناسایی و حذف مافیا است. در نهایت، تیمی که به هدف خود برسد، پیروز بازی می‌شود.

با استفاده از اپلیکیشن «هم نشین»، بازی مافیا به راحتی و با انتخاب تصادفی نقش‌ها در هر زمان و مکانی برای شما و دوستانتان فراهم می‌شود. فقط کافی است دکمه سبز رنگ را بزنید تا بازی آغاز شود!""";
  static const cheshmakGameInfo =
      """در بازی «چشمک مرگ» که در اپلیکیشن «هم نشین» ارائه شده است، تعیین نقش‌ها به صورت خودکار از طریق اپلیکیشن انجام می‌شود. کاربران با کلیک بر روی یک دکمه سبز رنگ، به طور تصادفی نقش‌های خود را دریافت می‌کنند. این نقش‌ها شامل ۴ نفر پوچ، ۱ قاتل و ۱ کاراگاه می‌باشند. 

  توضیحات کلی بازی «چشمک مرگ»:
در این بازی، هر فرد نقشی دارد که باید در طول بازی آن را به‌خوبی ایفا کند. فردی که نقش قاتل را دارد باید به‌طور مخفیانه و با چشمک زدن به دیگران، افراد را از بازی حذف کند. تنها کاراگاه می‌تواند قاتل را شناسایی کرده و از آن جلوگیری کند.

  مراحل بازی:
1. **تعیین نقش‌ها**: پس از کلیک روی دکمه سبز در اپلیکیشن، هر کاربر یک نقش تصادفی دریافت می‌کند. این نقش‌ها می‌تواند یکی از ۴ نقش پوچ، قاتل یا کاراگاه باشد.
2. **هدف بازی**: هدف قاتل این است که با استفاده از چشمک، دیگران را حذف کند بدون اینکه شناسایی شود. کاراگاه باید قاتل را شناسایی کرده و از ادامه بازی او جلوگیری کند.
3. **نحوه اجرای بازی**: هر بازیکن باید نقش خود را به‌طور مخفیانه بازی کند. قاتل باید سعی کند چشمک بزند به طوری که دیگران متوجه نشوند. کاراگاه باید تلاش کند قاتل را شناسایی کرده و او را از بازی حذف کند.
4. **برنده بازی**: بازی تا زمانی ادامه می‌یابد که یا قاتل تمام بازیکنان را حذف کند، یا کاراگاه قاتل را شناسایی کرده و او را از بازی بیرون کند.

با این سیستم خودکار در اپلیکیشن، کاربران می‌توانند به‌راحتی در هر لحظه نقش خود را دریافت کرده و بازی را شروع کنند .""";
  static const pantGame =
      """پانتومیم یکی از بازی‌های جذاب و محبوب گروهی است که در آن بازیکنان باید بدون استفاده از کلمات و تنها با حرکات بدن، یک کلمه یا عبارت مشخص را به دیگران منتقل کنند. این بازی علاوه بر تقویت خلاقیت و مهارت‌های ارتباطی، لحظات خنده‌دار و خاطره‌انگیزی را برای جمع‌های دوستانه و خانوادگی ایجاد می‌کند.  

در اپلیکیشن "هم‌نشین"، پانتومیم به شکلی ساده و خلاقانه طراحی شده است: با کلیک بر روی دکمه سبز رنگ، یک کلمه مناسب برای اجرا به شما پیشنهاد می‌شود. این کلمات به‌گونه‌ای انتخاب شده‌اند که برای همه افراد قابل فهم و سرگرم‌کننده باشند. تجربه‌ای متفاوت از پانتومیم را در "هم‌نشین" امتحان کنید!""";
  static const jorathaghighatGame = """بازی جرات یا حقیقت چیست؟
بازی “جرات یا حقیقت؟” یا ” بطری بازی” یک بازی گروهی بسیار جذاب است که معمولا در مهمانی‌ها اجرا می‌شود. همه ی ما حتما یک بار این بازی را انجام داده ایم.

بازی به این صورت است که در این بازی، همه افراد دایره‌وار می‌نشینند یک بطری در وسط جمع قرار داده می‌شود، سپس افراد به نوبت بطری را می‌چرخانند. بالای بطری به سمت هر شخصی باشد آن شخص میتواند از بین گزینه های حقیقت و یا شجاعت یکی را برگزیند که در این صورت باید به یک سوال در مورد حقیقت زندگی اش پاسخ دهد و یا کاری سخت را انجام دهد. بطری بازی در بین نوجوانان و حتی بزرگسالان بسیار محبوب است.

بازی جرات و حقیقت1

پیشنهادات برای کارهایی که برای جرات باید انجام دهند:
– روی پای نفر بغلی تا آخر مسابقه بنشینید.

– یک لیوان آب سرد بر روی سرتان بریزید.

– برای ۱ دقیقه کلاغ پر بروید.

– دور همه افراد اتاق ۵ بار بچرخید.

– زنگ در همسایه را بزنید و دستمال کاغذی بخواهید.

– همه محتویات داخل کیف‌تان را خالی کنید.

– آخرین پیام کوتاه که گرفتین را بلند بخوانید.

– برای همه افراد داخل جمع باید بستنی یا … بخرید.""";
  static const sdjvGameinfo =
      """بازی "شاه، دزد، جلاد، وزیر" یک بازی گروهی هیجان‌انگیز برای ۴ نفر است که در آن هر بازیکن یکی از چهار نقش مهم را بر عهده می‌گیرد. در این بازی، وزیر تلاش می‌کند دزد را شناسایی کند. اگر حدس درست باشد، جلاد دزد را مجازات می‌کند. اگر اشتباه باشد، وزیر مجازات می‌شود.

نحوه بازی:

در ابتدای بازی، بازیکنان  نقش خود را دریافت می‌کنند.
شاه به وزیر دستور می‌دهد که دزد را پیدا کند.
وزیر تلاش می‌کند دزد را شناسایی کند. اگر حدس درست باشد، جلاد دزد را مجازات می‌کند. اگر اشتباه باشد، وزیر مجازات می‌شود.
پس از هر دور، بازی دوباره شروع می‌شود تا یک نفر برنده شود.
شکنجه‌ها: بازی شامل شکنجه‌های مختلفی است که می‌تواند به صورت خلاقانه تغییر کند و به نوعی سرگرم‌کننده و مناسب برای جمع‌های دوستانه باشد.

در اپلیکیشن "هم‌نشین"، این بازی به راحتی و با کلیک روی دکمه سبز رنگ آغاز می‌شود و یک نقش تصادفی به هر بازیکن اختصاص می‌یابد تا تجربه‌ای جذاب و منحصر به فرد از این بازی کلاسیک داشته باشند.

""";
  static const jasoosGame =
      """بازی "اسپای فال" (جاسوس) یک بازی گروهی هیجان‌انگیز است که در آن بازیکنان باید با پرسیدن سوالات هوشمندانه و تجزیه و تحلیل پاسخ‌های دیگران، جاسوس را شناسایی کنند. در این بازی، یک کلمه به طور تصادفی به شهروندان اعلام می‌شود، اما جاسوس از آن کلمه بی‌اطلاع است و باید با کمک سوالات خود، کلمه را حدس بزند.

**نقش‌ها:**
- **شهروندان**: از کلمه اطلاع دارند و باید با پرسیدن سوالات هوشمندانه، جاسوس را پیدا کنند.
- **جاسوس**: از کلمه بی‌اطلاع است و باید سعی کند اطلاعات را جمع‌آوری کرده و خود را از شلیک شدن نجات دهد.
- **کلانتر**: به عنوان یک شهروند با قدرت شلیک به یک بازیکن، جاسوس را شناسایی می‌کند.
- **جوکر**: همراه جاسوس است و باید اطلاعات نادرست ارائه دهد تا شهروندان را گمراه کند.

**نکات کلیدی برای برنده شدن:**
- **پرسش‌های دقیق و هوشمندانه**: سوالات باید طوری باشند که اطلاعات مفیدی راجع به کلمه بدهند بدون اینکه آن را لو دهند.
- **تجزیه و تحلیل پاسخ‌ها**: به دقت به پاسخ‌ها و زبان بدن بازیکنان توجه کنید تا تناقضات را شناسایی کنید.
- **مهارت متقاعدسازی و تشخیص دروغ**: با استدلال‌های منطقی و توجه به لحن صحبت دیگران، جاسوس را شناسایی کنید.

در اپلیکیشن "هم‌نشین"، بازی جاسوس به راحتی با کلیک بر روی دکمه سبز رنگ شروع می‌شود و یک نقش تصادفی برای هر بازیکن پیشنهاد می‌شود تا تجربه‌ای هیجان‌انگیز و چالش‌برانگیز از این بازی داشته باشند.""";
  static const dorGame =
      """دور یک بازی دورهمی خانوادگی پرهیجان و سرگرم‌کننده است که برای 3 تا 10 نفر طراحی شده است. در این بازی، شما باید با استفاده از خلاقیت و سرعت خود، کلمات را به هم تیمی‌هایتان برسانید و از اشاره به اجزای اصلی کلمات یا کلمات هم‌قافیه خودداری کنید.

نحوه بازی دورهمی دور:

آماده سازی:
خفاشان شب (بازیکنان) به صورت دو به دو با هم تیم می‌شوند و روبروی یکدیگر می‌نشینند.
برای هر نفر، یک کلمه از لیست کلمات به صورت تصادفی از دسته بندی های موجود انتخاب می‌شود.
شروع بازی:
یکی از اعضای تیم باید مفهوم کلمه انتخاب شده را با صحبت کردن به هم‌تیمی خود برساند.
هم‌تیمی باید کلمه را حدس بزند.
اگر موفق به حدس کلمه شود، نوبت به تیم بعدی می‌رسد.
این روند تا تمام شدن زمان بازی یا رسیدن به امتیاز مشخصی ادامه پیدا می‌کند.
نکات مهم:
دور پانتومیم نیست! شما باید کلمه را با صحبت کردن به هم‌تیمی خود برسانید.
از اشاره به اجزای اصلی کلمه یا کلمات هم‌قافیه (مخصوصا ترجمه انگلیسی) خودداری کنید.
خلاق باشید و از روش‌های مختلف برای رساندن کلمه به هم‌تیمی خود استفاده کنید.
مشخصات بازی دورهمی دور:

تعداد بازیکن: 4 تا 10 نفر (به صورت تیم های دونفره) 3 تا 10 نفر (به صورت تیم های یک نفره)
ژانر بازی: فکری، گروهی، سرگرم‌کننده
گروه سنی: 8 سال به بالا
مدت زمان بازی: در حال حاضر 1 الی 2 دقیقه در هر راند بازی

قوانین بازی دورهمی دور:

قانون کلی: هر بازیکن فقط می‌تواند در هر نوبت یک کلمه را به هم‌تیمی خود برساند. اگه کلمه را عوض کند امتیاز منفی می گیرند.
ممنوعیت‌ها:
اشاره به اجزای اصلی کلمه، کلمات هم‌قافیه یا انگلیسی
استفاده از اشارات مستقیم به اجسام موجود و مربوطه
صحبت به زبان خارجی
مجازات‌ها:
در صورت زیر پا گذاشتن قوانین، می توانید کلمه گروه مورد نطر را یکبار عوض کنید و سه امتیاز از آن تیم کم کنید.
می‌توان برای تیم بازنده مجازات‌های خنده‌داری در نظر گرفت.
بازی 20 دور: شبیه دور ولی با ترکیب بازی بیست سوالی ( بازی فکری خنده دار بزرگسالان):
بازی دور امتیازی (تیم و انفرادی ولی تفاوتش در گفتن کلمات و امتیاز است –بازی های گروهی خنده دار )
نکات:
دور یک بازی گروهی در منزل یا فضای باز است که در دسته بازی های خنده دار چند نفره اندروید قرار می گیرد که می‌تواند لحظات شاد و خاطره‌انگیزی را برای شما و دوستانتان رقم بزند.
این بازی به تقویت مهارت‌های خلاقیت، سرعت عمل، واژگان و کار گروهی شما کمک می‌کند.
دور را می‌توانید در هر مکان و شرایطی بازی کنید، فقط کافی است تعدادی دوست و گوشی‌های هوشمندتان را همراه داشته باشید. فقط اگر قرار است در مکانی بروید که اینترنت وجود ندارد از قبل کلمات را بروز کنید… چون برای بروزرسانی کلمات نیاز به اینترنت دارید.""";
}
